import sqlite3 as db
from random import randint
from datetime import datetime, date, time
# import LFM

connection = db.connect('school.db')
cursor = connection.cursor()

def students():
    cursor.execute('''
    DROP TABLE students
    ''')
    cursor.execute('''
    CREATE TABLE students (
    student_id INTEGER,
    last_name TEXT,
    first_name TEXT,
    middle_name TEXT,
    gender_id INTEGER,
    year_birth INTEGER,
    month_birth INTEGER,
    day_birth INTEGER,
    class_id INTEGER
    )
    ''').fetchall()

    for i in range(1, 101):
        sql = f'''
        INSERT INTO students
            (student_id, last_name, first_name, middle_name, gender_id, year_birth, month_birth, day_birth, class_id)
        VALUES
            ({i}, "{LFM.lnm[i-1]}", "{LFM.fnm[i-1]}", "{LFM.mnm[i-1]}", "{1}", "{randint(2007,2013)}", "{randint(1,12)}", "{randint(1,28)}","{randint(17,36)}");
        '''
        cursor.execute(sql)
    connection.commit()
    for i in range(1, 101):
        dt = date(randint(2007, 2012), randint(1, 12), randint(1, 28))
        sql = f'''
        INSERT INTO students
            (student_id, last_name, first_name, middle_name, gender_id, year_birth, month_birth, day_birth, class_id)
        VALUES
            ({i + 100}, "{LFM.lnf[i-1]}", "{LFM.fnf[i-1]}", "{LFM.mnf[i-1]}", "{2}", "{randint(2007,2013)}", "{randint(1,12)}", "{randint(1,28)}","{randint(17,36)}");
        '''
        cursor.execute(sql)

    # Фиксация изменений
    connection.commit()

def genders():
    cursor.execute('''
    CREATE TABLE genders (
    gender_id INTEGER,
    gender TEXT
    )
    ''').fetchall()
    sql = f'''
        INSERT INTO genders
            (gender_id, gender)
        VALUES
            ({1}, "мужской"),
            ({2}, "женский")
        '''
    cursor.execute(sql)
    connection.commit()

def classes():
    cursor.execute('''
    CREATE TABLE classes (
    class_id INTEGER,
    number_class INTEGER,
    letter_class TEXT,
    teacher_id INTEGER
    )
    ''').fetchall()
    for i in range(1,12):
        sql = f'''
            INSERT INTO classes
                (class_id, number_class, letter_class, teacher_id)
            VALUES
                ({4*i - 3},{i},"А",{randint(1,37)}),
                ({4*i - 2},{i},"Б",{randint(1,37)}),
                ({4*i - 1},{i},"В",{randint(1,37)}),
                ({4*i},{i},"Г",{randint(1,37)})
            '''
        cursor.execute(sql)
    connection.commit()

def schedule():
    cursor.execute('''
        CREATE TABLE schedule (
        schedule_id INTEGER,
        shift INTEGER,
        number_lesson INTEGER,
        time_start TIME,
        time_finish TIME
        );
        ''').fetchall()
    sql = f'''
        INSERT INTO schedule
        (schedule_id, shift, number_lesson, time_start, time_finish)
        VALUES
        ({1},{1},{1},"{time(8,00)}","{time(8,40)}"),
        ({2},{1},{2},"{time(8,45)}","{time(9,25)}"),
        ({3},{1},{3},"{time(9,35)}","{time(10,15)}"),
        ({4},{1},{4},"{time(10,30)}","{time(11,10)}"),
        ({5},{1},{5},"{time(11,15)}","{time(11,55)}"),
        ({6},{1},{6},"{time(12,00)}","{time(12,40)}"),
        ({7},{2},{1},"{time(13,00)}","{time(13,40)}"),
        ({8},{2},{2},"{time(13,45)}","{time(14,25)}"),
        ({9},{2},{3},"{time(14,35)}","{time(15,15)}"),
        ({10},{2},{4},"{time(15,30)}","{time(16,10)}"),
        ({11},{2},{5},"{time(16,15)}","{time(16,55)}"),
        ({12},{2},{6},"{time(17,00)}","{time(17,40)}");
        '''
    cursor.execute(sql)
    connection.commit()

def teachers():
    gen = 0
    # cursor.execute('''
    #     DROP TABLE teachers
    #     ''')
    # cursor.execute('''
    #     CREATE TABLE teachers (
    #     teacher_id INTEGER,
    #     last_name TEXT,
    #     first_name TEXT,
    #     middle_name TEXT,
    #     gender_id INTEGER,
    #     year_birth INTEGER,
    #     month_birth INTEGER,
    #     day_birth INTEGER
    #     );
    #     ''').fetchall()
    for i in range(1,55):
        if LFM.gt == 'м':
            gen = 1
        else:
            gen = 2
        sql = f'''
            INSERT INTO teachers
            (teacher_id,last_name,first_name,middle_name,gender_id,year_birth,month_birth,day_birth)
            VALUES
            ({i},"{LFM.lnt[i-1]}","{LFM.fnt[i-1]}","{LFM.mnt[i-1]}",{gen},{randint(1973,1998)},{randint(1,12)},{randint(1,28)});
            '''
        cursor.execute(sql)
    connection.commit()

def offices():
    # cursor.execute('''
    #     CREATE TABLE offices (
    #     cabinet_id INTEGER,
    #     flat_cabinet INTEGER,
    #     number_cabinet INTEGER,
    #     rows_desk INTEGER,
    #     columns_desk INTEGER,
    #     count_options INTEGER
    #     );
    #     ''').fetchall()
    sql = f'''
        INSERT INTO offices
        (cabinet_id,
        flat_cabinet,
        number_cabinet,
        rows_desk,
        columns_desk,
        count_options)
        VALUES
        ({1},{1},{100},{5},{3},{2}),
        ({2},{1},{101},{5},{3},{2}),
        ({3},{1},{102},{5},{3},{2}),
        ({4},{1},{103},{5},{3},{2}),
        ({5},{1},{107},{5},{3},{2}),
        ({6},{1},{108},{5},{3},{2}),
        ({7},{1},{109},{5},{3},{2}),
        ({8},{1},{110},{6},{3},{1}),
        ({9},{1},{112},{6},{3},{1}),
        ({10},{2},{109},{5},{3},{2}),
        ({11},{2},{200},{5},{3},{2}),
        ({12},{2},{201},{5},{3},{2}),
        ({13},{2},{206},{5},{3},{2}),
        ({14},{2},{207},{5},{3},{2}),
        ({15},{2},{208},{5},{3},{2}),
        ({16},{2},{209},{5},{3},{2}),
        ({17},{2},{212},{5},{3},{2}),
        ({18},{2},{213},{5},{3},{2}),
        ({19},{2},{214},{5},{3},{2}),
        ({20},{2},{215},{5},{3},{2}),
        ({21},{3},{300},{5},{3},{2}),
        ({22},{3},{301},{5},{3},{2}),
        ({23},{3},{302},{5},{3},{2}),
        ({24},{3},{303},{5},{3},{2}),
        ({25},{3},{304},{5},{3},{2}),
        ({26},{3},{305},{8},{4},{1}),
        ({27},{3},{306},{8},{4},{1}),
        ({28},{3},{307},{5},{3},{2}),
        ({29},{3},{309},{5},{3},{2}),
        ({30},{3},{310},{5},{3},{2}),
        ({31},{3},{311},{5},{3},{2});
        '''
    cursor.execute(sql)
    connection.commit()

def records_cabinet():
    # cursor.execute('''
    # DROP TABLE record_cabinet
    # ''')
    # cursor.execute('''
    #     CREATE TABLE record_cabinet (
    #     record_id INTEGER,
    #     schedule_id INTEGER,
    #     date TEXT,
    #     subject_id INTEGER,
    #     teacher_id INTEGER,
    #     cabinet_id INTEGER,
    #     student_id INTEGER,
    #     row INTEGER,
    #     column INTEGER,
    #     option INTEGER
    #     );
    #     ''').fetchall()
    sql = f'''
        INSERT INTO record_cabinet
        (record_id,
        year_record,
        month_record,
        day_record,
        schedule_id,
        subject_id,
        teacher_id,
        cabinet_id,
        student_id,
        row_desk,
        column_desk,
        option_desk)
        VALUES
        ({1},{2023},{2},{1},{1},{3},{5},{10},{119},{1},{1},{1}),
        ({2},{2023},{2},{1},{1},{3},{5},{10},{141},{1},{1},{2}),
        ({3},{2023},{2},{1},{1},{3},{5},{10},{155},{1},{2},{1}),
        ({4},{2023},{2},{1},{1},{3},{5},{10},{173},{1},{2},{2}),
        ({5},{2023},{2},{1},{1},{3},{5},{10},{178},{1},{3},{1}),
        ({6},{2023},{2},{1},{1},{3},{5},{10},{182},{1},{3},{2}),
        ({7},{2023},{2},{1},{2},{3},{13},{10},{9},{1},{1},{1}),
        ({8},{2023},{2},{1},{2},{3},{13},{10},{39},{1},{1},{2}),
        ({9},{2023},{2},{1},{2},{3},{13},{10},{43},{1},{2},{1}),
        ({10},{2023},{2},{1},{2},{3},{13},{10},{47},{1},{2},{2}),
        ({11},{2023},{2},{1},{2},{3},{13},{10},{51},{1},{3},{1}),
        ({12},{2023},{2},{1},{2},{3},{13},{10},{55},{1},{3},{2}),
        ({13},{2023},{2},{1},{2},{3},{13},{10},{66},{2},{1},{1}),
        ({14},{2023},{2},{1},{2},{3},{13},{10},{75},{2},{1},{2}),
        ({15},{2023},{2},{1},{2},{3},{13},{10},{90},{2},{2},{1}),
        ({16},{2023},{2},{1},{2},{3},{13},{10},{91},{2},{2},{2}),
        ({17},{2023},{2},{1},{2},{3},{13},{10},{93},{2},{3},{1}),
        ({18},{2023},{2},{1},{2},{3},{13},{10},{103},{2},{3},{2}),
        ({19},{2023},{2},{1},{2},{3},{13},{10},{112},{3},{1},{1}),
        ({20},{2023},{2},{1},{2},{3},{13},{10},{200},{3},{1},{2}),
        ({21},{2023},{2},{1},{3},{3},{14},{10},{10},{1},{1},{1}),
        ({22},{2023},{2},{1},{3},{3},{14},{10},{12},{1},{1},{2}),
        ({23},{2023},{2},{1},{3},{3},{14},{10},{17},{1},{2},{1}),
        ({24},{2023},{2},{1},{3},{3},{14},{10},{28},{1},{2},{2}),
        ({25},{2023},{2},{1},{3},{3},{14},{10},{77},{1},{3},{1}),
        ({26},{2023},{2},{1},{3},{3},{14},{10},{78},{1},{3},{2}),
        ({27},{2023},{2},{1},{3},{3},{14},{10},{83},{2},{1},{1}),
        ({28},{2023},{2},{1},{3},{3},{14},{10},{98},{2},{1},{2}),
        ({29},{2023},{2},{1},{3},{3},{14},{10},{108},{2},{2},{1}),
        ({30},{2023},{2},{1},{3},{3},{14},{10},{132},{2},{2},{2}),
        ({31},{2023},{2},{1},{3},{3},{14},{10},{164},{2},{3},{1}),
        ({32},{2023},{2},{1},{3},{3},{14},{10},{193},{2},{3},{2}),
        ({33},{2023},{2},{1},{3},{3},{14},{10},{196},{3},{1},{1}),
        ({34},{2023},{2},{1},{3},{3},{14},{10},{198},{3},{1},{2}),
        ({35},{2023},{2},{1},{4},{4},{14},{10},{119},{1},{1},{1}),
        ({36},{2023},{2},{1},{4},{4},{14},{10},{141},{1},{1},{2}),
        ({37},{2023},{2},{1},{4},{4},{14},{10},{155},{1},{2},{1}),
        ({38},{2023},{2},{1},{4},{4},{14},{10},{173},{1},{2},{2}),
        ({39},{2023},{2},{1},{4},{4},{14},{10},{178},{1},{3},{1}),
        ({40},{2023},{2},{1},{4},{4},{14},{10},{182},{1},{3},{2}),
        ({41},{2023},{2},{1},{7},{3},{10},{10},{57},{1},{1},{1}),
        ({42},{2023},{2},{1},{7},{3},{10},{10},{87},{1},{1},{2}),
        ({43},{2023},{2},{1},{7},{3},{10},{10},{110},{1},{2},{1}),
        ({44},{2023},{2},{1},{7},{3},{10},{10},{124},{1},{2},{2}),
        ({45},{2023},{2},{1},{7},{3},{10},{10},{146},{1},{3},{1}),
        ({46},{2023},{2},{1},{7},{3},{10},{10},{152},{1},{3},{2}),
        ({47},{2023},{2},{1},{7},{3},{10},{10},{161},{2},{1},{1}),
        ({48},{2023},{2},{1},{7},{3},{10},{10},{163},{2},{1},{2}),
        ({49},{2023},{2},{1},{7},{3},{10},{10},{186},{2},{2},{1}),
        ({50},{2023},{2},{1},{10},{3},{10},{10},{24},{1},{1},{1}),
        ({51},{2023},{2},{1},{10},{3},{10},{10},{42},{1},{1},{2}),
        ({52},{2023},{2},{1},{10},{3},{10},{10},{76},{1},{2},{1}),
        ({53},{2023},{2},{1},{10},{3},{10},{10},{85},{1},{2},{2}),
        ({54},{2023},{2},{1},{10},{3},{10},{10},{135},{1},{3},{1}),
        ({55},{2023},{2},{1},{10},{3},{10},{10},{159},{1},{3},{2}),
        ({56},{2023},{2},{1},{10},{3},{10},{10},{162},{2},{1},{1}),
        ({57},{2023},{2},{1},{11},{4},{20},{10},{2},{1},{1},{1}),
        ({58},{2023},{2},{1},{11},{4},{20},{10},{21},{1},{1},{2}),
        ({59},{2023},{2},{1},{11},{4},{20},{10},{67},{1},{2},{1}),
        ({60},{2023},{2},{1},{11},{4},{20},{10},{96},{1},{2},{2}),
        ({61},{2023},{2},{1},{11},{4},{20},{10},{125},{1},{3},{1}),
        ({62},{2023},{2},{1},{11},{4},{20},{10},{140},{1},{3},{2}),
        ({63},{2023},{2},{1},{11},{4},{20},{10},{187},{2},{1},{1}),
        ({64},{2023},{2},{1},{11},{4},{20},{10},{194},{2},{1},{2}),
        ({65},{2023},{2},{1},{12},{4},{20},{10},{4},{1},{1},{1}),
        ({66},{2023},{2},{1},{12},{4},{20},{10},{26},{1},{1},{2}),
        ({67},{2023},{2},{1},{12},{4},{20},{10},{32},{1},{2},{1}),
        ({68},{2023},{2},{1},{12},{4},{20},{10},{37},{1},{2},{2}),
        ({69},{2023},{2},{1},{12},{4},{20},{10},{41},{1},{3},{1}),
        ({70},{2023},{2},{1},{12},{4},{20},{10},{46},{1},{3},{2}),
        ({71},{2023},{2},{1},{12},{4},{20},{10},{48},{2},{1},{1}),
        ({72},{2023},{2},{1},{12},{4},{20},{10},{61},{2},{1},{2}),
        ({73},{2023},{2},{1},{12},{4},{20},{10},{88},{2},{2},{1}),
        ({74},{2023},{2},{1},{12},{4},{20},{10},{107},{2},{2},{2}),
        ({75},{2023},{2},{1},{12},{4},{20},{10},{116},{2},{3},{1}),
        ({76},{2023},{2},{1},{12},{4},{20},{10},{150},{2},{3},{2}),
        ({77},{2023},{2},{1},{12},{4},{20},{10},{179},{3},{1},{1}),
        ({78},{2023},{2},{1},{12},{4},{20},{10},{181},{3},{1},{2})
        ;
        '''
    cursor.execute(sql)
    connection.commit()

def subjects():
    cursor.execute('''
        DROP TABLE subjects
        ''')
    cursor.execute('''
    CREATE TABLE subjects(
        subject_id INTEGER,
        subject_name TEXT,
        teacher_id INTEGER
    );
    ''').fetchall()
    sql = f'''
    INSERT INTO subjects(
        subject_id,
        subject_name,
        teacher_id
    ) VALUES
    ({1},"русский-язык",{1}),
    ({1},"русский-язык",{2}),
    ({1},"русский-язык",{3}),
    ({1},"русский-язык",{4}),
    ({1},"русский-язык",{6}),
    ({1},"русский-язык",{7}),
    ({2},"литература",{1}),
    ({2},"литература",{3}),
    ({2},"литература",{4}),
    ({3},"математика",{5}),
    ({3},"математика",{8}),
    ({3},"математика",{9}),
    ({3},"математика",{10}),
    ({3},"математика",{11}),
    ({3},"математика",{13}),
    ({3},"математика",{14}),
    ({3},"математика",{15}),
    ({4},"физика",{12}),
    ({4},"физика",{16}),
    ({4},"физика",{17}),
    ({4},"физика",{18}),
    ({4},"физика",{20}),
    ({4},"физика",{14}),
    ({5},"химия",{19}),
    ({5},"химия",{21}),
    ({6},"биология",{24}),
    ({6},"биология",{28}),
    ({7},"география",{22}),
    ({7},"география",{29}),
    ({8},"информатика",{23}),
    ({8},"информатика",{25}),
    ({8},"информатика",{26}),
    ({8},"информатика",{27}),
    ({9},"английский-язык",{30}),
    ({9},"английский-язык",{31}),
    ({9},"английский-язык",{32}),
    ({9},"английский-язык",{33}),
    ({10},"физкультура",{34}),
    ({10},"физкультура",{35}),
    ({10},"физкультура",{38}),
    ({11},"история",{36}),
    ({11},"история",{37}),
    ({12},"обществознания",{39}),
    ({12},"обществознания",{40}),
    ({13},"технология для мальчиков",{43}),
    ({14},"технология для девочек",{41}),
    ({15},"начальные классы",{42}),
    ({15},"начальные классы",{44}),
    ({15},"начальные классы",{45}),
    ({15},"начальные классы",{46}),
    ({15},"начальные классы",{47}),
    ({15},"начальные классы",{48}),
    ({15},"начальные классы",{49}),
    ({15},"начальные классы",{50}),
    ({15},"начальные классы",{51}),
    ({15},"начальные классы",{52}),
    ({15},"начальные классы",{53}),
    ({15},"начальные классы",{54});
    '''
    cursor.execute(sql)
    connection.commit()

records_cabinet()